-- phpMyAdmin SQL Dump
-- version 4.0.6
-- http://www.phpmyadmin.net
--
-- 主機: localhost
-- 產生日期: 2016 年 05 月 02 日 17:05
-- 伺服器版本: 5.5.28-log
-- PHP 版本: 5.4.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 資料庫: `u112`
--

-- --------------------------------------------------------

--
-- 表的結構 `商品`
--

CREATE TABLE IF NOT EXISTS `商品` (
  `商品編號` int(4) NOT NULL,
  `名稱` varchar(9) CHARACTER SET utf8 NOT NULL,
  `價錢` int(4) NOT NULL,
  `圖檔名稱` varchar(150) NOT NULL,
  `商家編號` int(11) NOT NULL,
  PRIMARY KEY (`商品編號`),
  KEY `商家編號` (`商家編號`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 轉存資料表中的資料 `商品`
--

INSERT INTO `商品` (`商品編號`, `名稱`, `價錢`, `圖檔名稱`, `商家編號`) VALUES
(1, '滷排骨便當', 65, 'http://120.119.80.13/~u112/image/t101.jpg', 1),
(2, '鱈魚便當', 70, 'http://120.119.80.13/~u112/image/t102.jpg', 1),
(3, '鲭魚便當', 65, 'http://120.119.80.13/~u112/image/t103.jpg', 1),
(4, '蔬食便當', 50, 'http://120.119.80.13/~u112/image/t104.jpg', 1),
(5, '炸排骨便當', 65, 'http://120.119.80.13/~u112/image/t105.jpg', 1),
(6, '香雞排便當', 75, 'http://120.119.80.13/~u112/image/t106.jpg', 1),
(7, '炸蝦便當', 70, 'http://120.119.80.13/~u112/image/t107.jpg', 1),
(8, '控肉便當', 70, 'http://120.119.80.13/~u112/image/t108.jpg', 1),
(9, '肉燥便當', 50, 'http://120.119.80.13/~u112/image/t109.jpg', 1),
(10, '三杯雞便當', 65, 'http://120.119.80.13/~u112/image/t110.jpg', 1),
(11, '炸小雞腿便當', 65, 'http://120.119.80.13/~u112/image/t111.jpg', 1),
(12, '炸大雞腿便當', 85, 'http://120.119.80.13/~u112/image/t112.jpg', 1),
(13, '綜合炒飯', 70, 'http://120.119.80.13/~u112/image/t201.jpg', 2),
(14, '肉絲炒飯', 50, 'http://120.119.80.13/~u112/image/t202.jpg', 2),
(15, '蝦仁炒飯', 55, 'http://120.119.80.13/~u112/image/t203.jpg', 2),
(16, '蛋炒飯', 40, 'http://120.119.80.13/~u112/image/t204.jpg', 2),
(17, '韓式泡菜炒飯', 80, 'http://120.119.80.13/~u112/image/t205.jpg', 2),
(18, '鮪魚炒飯', 65, 'http://120.119.80.13/~u112/image/t206.jpg', 2),
(19, '沙茶雞肉炒飯', 75, 'http://120.119.80.13/~u112/image/t207.jpg', 2),
(20, '沙茶豬肉炒飯', 75, 'http://120.119.80.13/~u112/image/t208.jpg', 2),
(21, '沙茶牛肉炒飯', 80, 'http://120.119.80.13/~u112/image/t209.jpg', 2),
(22, '咖哩炒飯', 70, 'http://120.119.80.13/~u112/image/t210.jpg', 2),
(23, '雞排炒飯', 85, 'http://120.119.80.13/~u112/image/t211.jpg', 2),
(24, '香腸炒飯', 60, 'http://120.119.80.13/~u112/image/t212.jpg', 2),
(25, '醬油拉麵', 90, 'http://120.119.80.13/~u112/image/t301.jpg', 3),
(26, '叉燒拉麵', 110, 'http://120.119.80.13/~u112/image/t302.jpg', 3),
(27, '豚骨拉麵', 110, 'http://120.119.80.13/~u112/image/t303.jpg', 3),
(28, '蔥燒拉麵', 110, 'http://120.119.80.13/~u112/image/t304.jpg', 3),
(29, '地獄拉麵', 110, 'http://120.119.80.13/~u112/image/t305.jpg', 3),
(30, '味噌拉麵', 100, 'http://120.119.80.13/~u112/image/t306.jpg', 3),
(31, '番茄拉麵', 110, 'http://120.119.80.13/~u112/image/t307.jpg', 3),
(32, '鹽味拉麵', 110, 'http://120.119.80.13/~u112/image/t308.jpg', 3),
(33, '招牌拉麵', 120, 'http://120.119.80.13/~u112/image/t309.JPG', 3),
(34, '雞腿拉麵', 150, 'http://120.119.80.13/~u112/image/t310.jpg', 3),
(35, '天婦羅拉麵', 150, 'http://120.119.80.13/~u112/image/t311.jpg', 3),
(36, '蔬菜拉麵', 100, 'http://120.119.80.13/~u112/image/t312.jpg', 3),
(37, '單層牛肉漢堡套餐', 110, 'http://120.119.80.13/~u112/image/t401.jpg', 4),
(38, '雙層牛肉漢堡套餐', 150, 'http://120.119.80.13/~u112/image/t402.jpg', 4),
(39, '炸雞漢堡', 65, 'http://120.119.80.13/~u112/image/t403.jpg', 4),
(40, '烤雞漢堡', 65, 'http://120.119.80.13/~u112/image/t404.JPG', 4),
(41, '豬排漢堡', 50, 'http://120.119.80.13/~u112/image/t405.jpg', 4),
(42, '火腿漢堡', 50, 'http://120.119.80.13/~u112/image/t406.jpg', 4),
(43, '總匯漢堡', 90, 'http://120.119.80.13/~u112/image/t407.jpg', 4),
(44, '洋蔥圈', 50, 'http://120.119.80.13/~u112/image/t408.jpg', 4),
(45, '波浪薯條', 45, 'http://120.119.80.13/~u112/image/t409.jpg', 4),
(46, '烤雞翅', 70, 'http://120.119.80.13/~u112/image/t410.jpg', 4),
(47, '雪碧', 25, 'http://120.119.80.13/~u112/image/t411.jpg', 4),
(48, '可樂', 25, 'http://120.119.80.13/~u112/image/t412.jpg', 4),
(49, '紅茶', 20, 'http://120.119.80.13/~u112/image/t501.jpg', 5),
(50, '綠茶', 20, 'http://120.119.80.13/~u112/image/t502.jpg', 5),
(51, '青茶', 20, 'http://120.119.80.13/~u112/image/t503.jpg', 5),
(52, '冬瓜茶', 20, 'http://120.119.80.13/~u112/image/t504.jpg', 5),
(53, '仙草干茶', 20, 'http://120.119.80.13/~u112/image/t505.jpg', 5),
(54, '奶茶', 30, 'http://120.119.80.13/~u112/image/t506.jpg', 5),
(55, '多多綠茶', 30, 'http://120.119.80.13/~u112/image/t507.jpg', 5),
(56, '烏龍茶', 25, 'http://120.119.80.13/~u112/image/t508.jpg', 5),
(57, '荔枝奶茶', 40, 'http://120.119.80.13/~u112/image/t509.jpg', 5),
(58, '豆漿紅茶', 40, 'http://120.119.80.13/~u112/image/t510.jpg', 5),
(59, '紅茶拿鐵', 50, 'http://120.119.80.13/~u112/image/t511.jpg', 5),
(60, '台灣高山茶', 60, 'http://120.119.80.13/~u112/image/t512.jpg', 5),
(61, '經典肉醬義大利麵', 100, 'http://120.119.80.13/~u112/image/t601.jpg', 6),
(62, '青醬蛤蠣義大利麵', 100, 'http://120.119.80.13/~u112/image/t602.jpg', 6),
(63, '白醬蘑菇義大利麵', 100, 'http://120.119.80.13/~u112/image/t603.JPG', 6),
(64, '番茄鮮蝦義大利麵', 100, 'http://120.119.80.13/~u112/image/t604.jpg', 6),
(65, '燻腸肉醬義大利麵', 100, 'http://120.119.80.13/~u112/image/t605.jpg', 6),
(66, '鮮魚青醬義大利麵', 100, 'http://120.119.80.13/~u112/image/t606.jpg', 6),
(67, '焗烤肉醬千層麵', 120, 'http://120.119.80.13/~u112/image/t607.jpg', 6),
(68, '奶油蔬菜千層麵', 120, 'http://120.119.80.13/~u112/image/t608.jpg', 6),
(69, '墨魚義大利麵', 120, 'http://120.119.80.13/~u112/image/t609.jpg', 6),
(70, '香蒜培根義大利麵', 120, 'http://120.119.80.13/~u112/image/t610.jpg', 6),
(71, '紅醬肉丸義大利麵', 130, 'http://120.119.80.13/~u112/image/t611.jpg', 6),
(72, '鮮蝦海鮮燉飯', 250, 'http://120.119.80.13/~u112/image/t612.jpg', 6),
(73, '肉燥飯', 35, 'http://120.119.80.13/~u112/image/t701.jpg', 7),
(74, '雞肉飯', 35, 'http://120.119.80.13/~u112/image/t702.jpg', 7),
(75, '控肉飯', 45, 'http://120.119.80.13/~u112/image/t703.jpg', 7),
(76, '筒仔米糕', 30, 'http://120.119.80.13/~u112/image/t704.jpg', 7),
(77, '碗粿', 30, 'http://120.119.80.13/~u112/image/t705.jpg', 7),
(78, '清燙空心菜', 30, 'http://120.119.80.13/~u112/image/t706.jpg', 7),
(79, '蒜泥白肉', 50, 'http://120.119.80.13/~u112/image/t707.jpg', 7),
(80, '客家小炒', 100, 'http://120.119.80.13/~u112/image/t708.jpg', 7),
(81, '白斬雞 ', 150, 'http://120.119.80.13/~u112/image/t709.jpg', 7),
(82, '高粱香腸', 100, 'http://120.119.80.13/~u112/image/t710.jpg', 7),
(83, '苦瓜排骨湯', 45, 'http://120.119.80.13/~u112/image/t711.JPG', 7),
(84, '冬瓜蛤蠣湯', 45, 'http://120.119.80.13/~u112/image/t712.jpg', 7),
(85, '鍋燒意麵', 50, 'http://120.119.80.13/~u112/image/t801.jpg', 8),
(86, '鍋燒雞絲麵', 50, 'http://120.119.80.13/~u112/image/t802.jpg', 8),
(87, '鍋燒泡麵', 50, 'http://120.119.80.13/~u112/image/t803.jpg', 8),
(88, '肉燥乾麵', 40, 'http://120.119.80.13/~u112/image/t804.jpg', 8),
(89, '炸醬拌麵', 40, 'http://120.119.80.13/~u112/image/t805.jpg', 8),
(90, '餛飩湯麵', 45, 'http://120.119.80.13/~u112/image/t806.jpg', 8),
(91, '鮮肉水餃', 45, 'http://120.119.80.13/~u112/image/t807.jpg', 8),
(92, '酥香煎餃', 45, 'http://120.119.80.13/~u112/image/t808.jpg', 8),
(93, '台式小火鍋', 110, 'http://120.119.80.13/~u112/image/t809.jpg', 8),
(94, '海鮮小火鍋', 110, 'http://120.119.80.13/~u112/image/t810.jpg', 8),
(95, '泡菜小火鍋', 110, 'http://120.119.80.13/~u112/image/t811.jpg', 8),
(96, '蔬食小火鍋 ', 110, 'http://120.119.80.13/~u112/image/t812.jpg', 8),
(97, '豬肉石鍋拌飯', 80, 'http://120.119.80.13/~u112/image/t901.jpg', 9),
(98, '雞肉石鍋拌飯', 80, 'http://120.119.80.13/~u112/image/t902.jpg', 9),
(99, '泡菜冷麵', 65, 'http://120.119.80.13/~u112/image/t903.jpg', 9),
(100, '炸醬麵', 60, 'http://120.119.80.13/~u112/image/t904.jpg', 9),
(101, '星星炸雞', 80, 'http://120.119.80.13/~u112/image/t905.jpg', 9),
(102, '辣炒年糕', 50, 'http://120.119.80.13/~u112/image/t906.jpg', 9),
(103, '泡菜燒肉片', 80, 'http://120.119.80.13/~u112/image/t907.jpg', 9),
(104, '海鮮煎餅', 70, 'http://120.119.80.13/~u112/image/t908.jpg', 9),
(105, '泡麵部隊鍋', 120, 'http://120.119.80.13/~u112/image/t909.jpg', 9),
(106, '泡菜豆腐鍋', 100, 'http://120.119.80.13/~u112/image/t910.jpg', 9),
(107, '人參雞湯', 150, 'http://120.119.80.13/~u112/image/t911.jpg', 9),
(108, '綜合泡菜盤', 40, 'http://120.119.80.13/~u112/image/t912.jpg', 9);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
